# Level Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElement..::..Level Property
SpatialElement Class See Also
---
Gets the level of the room.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Level Level { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Level As Level
	Get
```

Visual C++
---
```text
public:
property Level^ Level {
	Level^ get ();
}
```

# See Also
SpatialElement Class
Autodesk.Revit.DB Namespace